import random

my_list = []

for _ in range(10):
    my_list.append(random.randint(0, 5))

print(my_list)
my_sum = 0
for element in my_list:
    if element >= 4:
        my_sum = my_sum + element

print(my_sum)

print("Написать программу, которая выведет на экран все числа от 1 до 100 которые кратные n n вводится с клавиатуры")

my_str = input()
my_int = int(my_str)
for x in range(1, 101)
    if x % my_del == 0
        print(x)

for x